In [1]:
import pandas as pd
import seaborn as sns
import numpy as np
import matplotlib.pyplot as plt

In [2]:
from sklearn.model_selection import train_test_split
from sklearn.impute  import SimpleImputer
from sklearn.compose import ColumnTransformer

In [3]:
df=pd.read_csv('data/titanic_toy.csv')
df

      Age     Fare  Family  Survived
0    22.0   7.2500       1         0
1    38.0  71.2833       1         1
2    26.0   7.9250       0         1
3    35.0  53.1000       1         1
4    35.0   8.0500       0         0
..    ...      ...     ...       ...
886  27.0  13.0000       0         0
887  19.0  30.0000       0         1
888   NaN  23.4500       3         0
889  26.0      NaN       0         1
890  32.0   7.7500       0         0

[891 rows x 4 columns]

In [4]:
x=df.drop(columns=['Survived'])
y=df['Survived']

In [5]:
x_train,x_test,y_train,y_test=train_test_split(x,y,random_state=42,test_size=0.2)

In [7]:
x_train['Age_99']=x_train['Age'].fillna(99)
x_train['Age_minus1']=x_train['Age'].fillna(-1)

x_train['Fare_999']=x_train['Fare'].fillna(999)
x_train['Fare_minus1']=x_train['Fare'].fillna(-1)

In [12]:
print("Original Age Value ",x_train['Age'].var())
print("Original Age 99 Value ",x_train['Age_99'].var())
print("Original Age -1 Value ",x_train['Age_minus1'].var())

print()

print("Original Fare Value ",x_train['Fare'].var())
print("Original Fare 99 Value ",x_train['Fare_999'].var())
print("Original Fare -1 Value ",x_train['Fare_minus1'].var())

Original Age Value  210.2517072477435
Original Age 99 Value  932.9665366701432
Original Age -1 Value  315.9955036260055

Original Fare Value  2761.0314349486343
Original Fare 99 Value  47525.470595360035
Original Fare -1 Value  2675.2394049177024